package com.javarush.test.level01.lesson04.task02.level00.lesson03.task01;

/* Элли самая красивая
Написать программу, выводящую на экран надпись «Элли самая красивая» 5 раз. Каждый раз – с новой строки.
Пример вывода на экран:
Элли самая красивая
Элли самая красивая
Элли самая красивая
Элли самая красивая
Элли самая красивая
*/
public class Solution
{
    public static void main(String[] args)
    {
        String e = "Элли самая красивая";

        System.out.println(e);
        System.out.println(e);
        System.out.println(e);
        System.out.println(e);
        System.out.println(e);
    }
}
