package com.javarush.test.level04.lesson10.task04;

<<<<<<< HEAD
=======
import java.io.*;

>>>>>>> 2fb5e8213875d54d9aa85a522823c454221381d4
/* S-квадрат
Вывести на экран квадрат из 10х10 букв S используя цикл while.
Буквы в каждой строке не разделять.
*/

public class Solution
{
    public static void main(String[] args) throws Exception
    {

        int i = 10;

        while (i > 0) {
            System.out.println("SSSSSSSSSS");
            i--;
        }

    }
}
